hirata0517masato/RX621-CMouse/RX621_Cmausu_3rd_white1mm-15mm/r_flash_api_rx.c
/******************************************************************************
 Includes   <System Includes> , "Project Includes"
 ******************************************************************************/
/* Intrinsic functions of MCU */
#include <machine.h>
/* Used for boolean definitions */
#include <stdbool.h>
/* IO Registers definitions */
#include "iodefine.h"

/* Allocate flash block array here. This is required before including
   r_flash_api_rx_if.h */
#define FLASH_BLOCKS_DECLARE

/* Function prototypes and device specific info needed for Flash API */
#include "r_flash_api_rx_if.h"
/* Information needed for Flash API. */
#include "r_flash_api_rx_private.h"

/******************************************************************************
 Macro definitions
 ******************************************************************************/
/* Define read mode macro */
#define READ_MODE               (0)
/* Define ROM PE mode macro */
#define ROM_PE_MODE             (1)
/* Define data flash PE mode macro */
#define FLD_PE_MODE             (2)
/* The number of ICLK ticks needed for 35us delay are calculated below */
#define WAIT_TRESW              (35*(FLASH_API_RX_CFG_ICLK_HZ/1000000))
/* The number of ICLK ticks needed for 10us delay are calculated below */
#define WAIT_T10USEC            (10*(FLASH_API_RX_CFG_ICLK_HZ/1000000))
/* The number of loops to wait for FENTRYR timeout. */
#define FLASH_FENTRYR_TIMEOUT   (4)

/* This macro is used to suppress compiler messages about a parameter not being used in a function.
 * The nice thing about using this implementation is that it does not take any extra RAM or ROM.
 */
#define     INTERNAL_NOT_USED(p)    ((void)(p))

/******************************************************************************
 Typedef definitions
 ******************************************************************************/
/* These typedefs are used for guaranteeing correct accesses to memory.
   When working with the FCU sometimes byte or word accesses are required. */
typedef __evenaccess volatile uint8_t  * FCU_BYTE_PTR;
typedef __evenaccess volatile uint16_t * FCU_WORD_PTR;
typedef __evenaccess volatile uint32_t * FCU_LONG_PTR;

/* These flash states are used internal for locking purposes. */
typedef enum
{
    FLASH_READY,
    FLASH_ERASING,
    FLASH_WRITING,
    FLASH_BLANKCHECK,
    FLASH_LOCK_BIT
} flash_states_t;

/******************************************************************************
 Private global variables and functions
 ******************************************************************************/
/* Signals whether FCU firmware has been transferred to the FCU RAM
   0 : No, 1 : Yes */
static uint8_t        g_fcu_transfer_complete = 0;
/* Valid values are 'READ_MODE','ROM_PE_MODE' or 'FLD_PE_MODE' */
static uint8_t        g_current_mode;
/* Stores whether the peripheral clock notification command has
   been executed */
static uint8_t        g_fcu_pclk_command = 0;
/* States for flash operations */
static flash_states_t g_flash_state;

#ifndef FLASH_API_RX_CFG_IGNORE_LOCK_BITS
/* Determines whether lock bit protection is used when programming/erasing */
static uint8_t g_lock_bit_protection = true;
#endif

/* Only allocate these arrays if needed. */
#ifdef FLASH_API_RX_CFG_FLASH_TO_FLASH
/* Used for holding data when DF to DF write is performed */
    #if defined(ROM_PROGRAM_SIZE_LARGE)
static uint8_t g_temp_array[ROM_PROGRAM_SIZE_LARGE];
    #else
static uint8_t g_temp_array[ROM_PROGRAM_SIZE];
    #endif
/* Used for telling whether a DF to DF or ROM to ROM operation is on-going */
static uint8_t g_flash_to_flash_op;
#endif

#if defined(FLASH_API_RX_CFG_DATA_FLASH_BGO) || defined(FLASH_API_RX_CFG_ROM_BGO)
/* How many bytes are left to program */
static uint32_t  g_bgo_bytes;
/* Where we are programming or erasing */
static uint32_t  g_bgo_flash_addr;
/* Where the data is that we are programming */
static uint32_t  g_bgo_buffer_addr;
#endif

/* Flash initialization function prototype */
static uint8_t  flash_init(void);
/* Enter PE mode function prototype */
static uint8_t  enter_pe_mode(uint32_t flash_addr);
/* Exit PE mode function prototype */
static void     exit_pe_mode(void);
/* ROM write function prototype */
static uint8_t  rom_write(uint32_t address, uint32_t data, uint32_t size);
/* Data flash write function prototype */
static uint8_t  data_flash_write(uint32_t address, uint32_t data, uint32_t size);
/* Data flash status clear function prototype */
static void     data_flash_status_clear(void);
/* Notify peripheral clock function prototype */
static uint8_t  notify_peripheral_clock(FCU_BYTE_PTR flash_addr);
/* FCU reset function prototype */
static void     flash_reset(void);
/* Used to grab flash state */
static uint8_t  flash_grab_state(flash_states_t new_state);
/* Used to release flash state */
static void     flash_release_state(void);
/* Used to issue an erase command to the FCU */
static uint8_t  flash_erase_command(FCU_BYTE_PTR const erase_addr);
/* Used to get largest programming size that can be used. */
static uint32_t flash_get_program_size(uint32_t bytes, uint32_t flash_addr);
/* Used for checking that an input block is valid. */
static bool     flash_valid_block_check (uint32_t block);

/******************************************************************************
 * Function Name: flash_init
 * Description  : Initializes the FCU peripheral block.
 *                NOTE: This function does not have to execute from in RAM.
 * Arguments    : none
 * Return Value : FLASH_SUCCESS -
 *                    Operation Successful
 *                FLASH_FAILURE -
 *                    Operation Failed
 ******************************************************************************/
static uint8_t flash_init(void)
{
#if defined(FCU_RAM_INIT_REQUIRED)
    /* Declare source and destination pointers */
    uint32_t * src, * dst;
    /* Declare iteration counter variable */
    uint16_t i;
#endif
    /* Timeout counter. */
    volatile int32_t  wait_cnt;

    /* Disable FCU interrupts in FCU block */
    FLASH.FAEINT.BIT.ROMAEIE = 0;
    FLASH.FAEINT.BIT.CMDLKIE = 0;
    FLASH.FAEINT.BIT.DFLAEIE = 0;
    FLASH.FAEINT.BIT.DFLRPEIE = 0;
    FLASH.FAEINT.BIT.DFLWPEIE = 0;

    /* Disable FCU interrupts in ICU */

    /* Disable flash interface error (FIFERR) */
    IPR(FCU, FIFERR) = 0;
    IEN(FCU, FIFERR) = 0;

#if defined(FLASH_API_RX_CFG_DATA_FLASH_BGO) || defined(FLASH_API_RX_CFG_ROM_BGO)
    /* Enable flash ready interrupt (FRDYI) */
    /* Make sure IPL is high enough that interrupt will trigger */
    IPR(FCU, FRDYI) = FLASH_API_RX_CFG_FLASH_READY_IPL;
    IEN(FCU, FRDYI) = 1;
#else
    /* Disable flash ready interrupt (FRDYI) */
    IPR(FCU, FRDYI) = 0;
    IEN(FCU, FRDYI) = 0;
#endif

