hirata0517masato/RX621-CMouse/RX621_Cmausu_3rd_white1mm-15mm/r_flash_api_rx.c
    /* Transfer Firmware to the FCU RAM. To use FCU commands, the FCU firmware
        must be stored in the FCU RAM. */

    /* Before writing data to the FCU RAM, clear FENTRYR to stop the FCU. */
    if (0x0000 != FLASH.FENTRYR.WORD)
    {
        /* Disable the FCU from accepting commands - Clear both the
           FENTRY0(ROM) and FENTRYD(Data Flash) bits to 0 */
        FLASH.FENTRYR.WORD = 0xAA00;

        /* Initialize timeout for FENTRYR being written. */
        wait_cnt = FLASH_FENTRYR_TIMEOUT;

        /* Read FENTRYR to ensure it has been set to 0. Note that the top byte
           of the FENTRYR register is not retained and is read as 0x00. */
        while (0x0000 != FLASH.FENTRYR.WORD)
        {
            /* Wait until FENTRYR is 0 unless timeout occurs. */
            if (wait_cnt-- <= 0)
            {
                /* This should not happen. FENTRYR getting written to 0 should
                   only take 2-4 PCLK cycles. */
                return FLASH_FAILURE;
            }
        }
    }

#if defined(FCU_RAM_INIT_REQUIRED)
    /* Enable the FCU RAM */
    FLASH.FCURAME.WORD = 0xC401;

    /* Copies the FCU firmware to the FCU RAM.
       Source: H'FEFFE000 to H'FF00000 (FCU firmware area)
       Destination: H'007F8000 to H'007FA000 (FCU RAM area) */
    /* Set source pointer */
    src = (uint32_t *)FCU_PRG_TOP;

    /* Set destination pointer */
    dst = (uint32_t *)FCU_RAM_TOP;

    /* Iterate for loop to copy the FCU firmware */
    for (i = 0; i < (FCU_RAM_SIZE / 4); i++)
    {
        /* Copy data from the source to the destination pointer */
        *dst = *src;

        /* Increment the source and destination pointers */
        src++;
        dst++;
    }
#endif

    /* FCU firmware transfer complete, set the flag to 1 */
    g_fcu_transfer_complete = 1;

    /* Return no errors */
    return FLASH_SUCCESS;
}
/******************************************************************************
 End of function  flash_init
 ******************************************************************************/

#ifdef FLASH_API_RX_CFG_COPY_CODE_BY_API
/******************************************************************************
 * Function Name: R_FlashCodeCopy
 * Description  : Copies Flash API code from ROM to RAM. This function needs to
 *                be called before any program/erase functions. This function
 *                does not need to be used when
 *                NOTE: This function does not have to execute from in RAM.
 * Arguments    : none
 * Return Value : none
 ******************************************************************************/
void R_FlashCodeCopy(void)
{
#ifdef FLASH_API_RX_CFG_ENABLE_ROM_PROGRAMMING
    /* Pointer to beginning of RAM section where API code will be copied to. */
    uint8_t * p_ram_section;
    /* Pointer to beginning of ROM section with API code. */
    uint8_t * p_rom_section;
    /* Number of bytes copied. */
    uint32_t  bytes_copied;

    /* Initialize RAM section pointer. */
    p_ram_section = (uint8_t *)__sectop("RPFRAM");

    /* Initialize ROM section pointer. */
    p_rom_section = (uint8_t *)__sectop("PFRAM");

    /* Copy over code from ROM to RAM. */
    for (bytes_copied = 0; bytes_copied < __secsize("PFRAM"); bytes_copied++)
    {
        /* Copy over data 1 byte at a time. */
        p_ram_section[bytes_copied] = p_rom_section[bytes_copied];
    }
#endif
}
/******************************************************************************
 End of function  R_FlashCodeCopy
 ******************************************************************************/
#endif /* FLASH_API_RX_CFG_COPY_CODE_BY_API */

/******************************************************************************
 * Function Name: R_FlashGetVersion
 * Description  : Returns the current version of this module. The version number
 *                is encoded where the top 2 bytes are the major version number
 *                and the bottom 2 bytes are the minor version number. For
 *                example, Version 4.25 would be returned as 0x00040019.
 * Arguments    : none
 * Return Value : Version of this module.
 ******************************************************************************/
#pragma inline(R_FlashGetVersion)
uint32_t R_FlashGetVersion(void)
{
    return ((((uint32_t)RX_FLASH_API_VERSION_MAJOR) << 16) | ((uint32_t)RX_FLASH_API_VERSION_MINOR));
}
/******************************************************************************
 End of function  R_FlashGetVersion
 ******************************************************************************/

/******************************************************************************
 * Function Name: data_flash_status_clear
 * Description  : Clear the status of the Data Flash operation.
 *                NOTE: This function does not have to execute from in RAM.
 * Arguments    : none
 * Return Value : none
 ******************************************************************************/
static void data_flash_status_clear(void)
{
    /* Declare temporary pointer */
    FCU_BYTE_PTR ptrb;

    /* Set pointer to Data Flash to issue a FCU command if needed */
    ptrb = (FCU_BYTE_PTR)(DF_ADDRESS);

    /* Check to see if an error has occurred with the FCU.  If set, then
       issue a status clear command to bring the FCU out of the
       command-locked state */
    if (1 == FLASH.FSTATR0.BIT.ILGLERR)
    {
        /* FASTAT must be set to 0x10 before the status clear command
           can be successfully issued  */
        if (0x10 != FLASH.FASTAT.BYTE)
        {
            /* Set the FASTAT register to 0x10 so that a status clear
               command can be issued */
            FLASH.FASTAT.BYTE = 0x10;
        }
    }

    /* Issue a status clear command to the FCU */
    *ptrb = 0x50;
}
/******************************************************************************
 End of function  data_flash_status_clear
 ******************************************************************************/

