hirata0517masato/RX621-CMouse/RX621_Cmausu_3rd_white1mm-15mm/r_flash_api_rx.c
/******************************************************************************
 * Function Name: data_flash_write
 * Description  : Write either bytes to Data Flash area.
 *                NOTE: This function does not have to execute from in RAM.
 * Arguments    : address -
 *                    The address (in the Data Flash programming area)
 *                    to write the data to
 *                data -
 *                    The address of the data to write
 *                size -
 *                    The size of the data to write. Must be set to
 *                    either DF_PROGRAM_SIZE_LARGE or DF_PROGRAM_SIZE_SMALL.
 * Return Value : FLASH_SUCCESS -
 *                    Operation Successful
 *                FLASH_FAILURE -
 *                    Operation Failed
 ******************************************************************************/
static uint8_t data_flash_write(uint32_t address, uint32_t data, uint32_t size)
{
    /* Declare wait counter variable */
    volatile int32_t wait_cnt;

    /* Define loop iteration count variable */
    volatile uint32_t n = 0;

    /* Check data size is valid */
#if defined(DF_PROGRAM_SIZE_LARGE)
    if ((DF_PROGRAM_SIZE_LARGE == size) || (DF_PROGRAM_SIZE_SMALL == size))
#else
    if (DF_PROGRAM_SIZE_SMALL == size)
#endif
    {
        /* Perform bit shift since 2 bytes are written at a time */
        size = (uint8_t)(size >> 1);

        /* Send command to data flash area */
        *(FCU_BYTE_PTR)DF_ADDRESS = 0xE8;

        /* Specify data transfer size to data flash area */
        *(FCU_BYTE_PTR)DF_ADDRESS = size;

        /* Iterate through the number of data bytes */
        while (n++ < size)
        {
            /* Copy data from source address to destination area */
            *(FCU_WORD_PTR)address = *(uint16_t *)data;

            /* Increment data address by two bytes */
            data += 2;
        }

        /* Write the final FCU command for programming */
        *(FCU_BYTE_PTR)(DF_ADDRESS) = 0xD0;

#if !defined(FLASH_API_RX_CFG_DATA_FLASH_BGO)

        /* Set the wait counter with timeout value */
        wait_cnt = WAIT_MAX_DF_WRITE;


        /* Check if FCU has completed its last operation */
        while (0 == FLASH.FSTATR0.BIT.FRDY)
        {
            /* Decrement the wait counter */
            wait_cnt--;

            /* Check if the wait counter has reached zero */
            if (0 == wait_cnt)
            {
                /* Maximum time for writing a block has passed,
                   operation failed, reset FCU */
                flash_reset();

                /* Return FLASH_FAILURE, operation failure */
                return FLASH_FAILURE;
            }
        }

#endif

        /* Check for illegal command or programming errors */
        if ((1 == FLASH.FSTATR0.BIT.ILGLERR) || (1 == FLASH.FSTATR0.BIT.PRGERR))
        {
#if defined(FLASH_API_RX_CFG_DATA_FLASH_BGO)
            /* If DF BGO is enabled then the flash ready interrupt may already
             * have fired by now if a DF access violation occurred. The ISR
             * would clear the error and take the FCU out of PE state. Another
             * DF AE violation could occur when the interrupt returns because
             * the code above is still attempting to write to DF. To clear this
             * error the FCU will need to be put back into PE state so that
             * we can perform a status clear.
             */
            if (FLASH_READY == g_flash_state)
            {
                /* The only reason the state would be FLASH_READY is if the
                 * interrupt had already fired.
                 */
                g_current_mode = FLD_PE_MODE;

                enter_pe_mode(address);
            }
#endif
            /* Return FLASH_FAILURE, operation failure */
            return FLASH_FAILURE;
        }

    }
    /* Data size is invalid */
    else
    {
        /*Return FLASH_FAILURE, operation failure */
        return FLASH_FAILURE;
    }

    /* Return FLASH_SUCCESS, operation success */
    return FLASH_SUCCESS;
}
/******************************************************************************
 End of function  data_flash_write
 ******************************************************************************/

/* If FLASH_API_RX_CFG_ROM_BGO is enabled then the following functions (before
   the next #pragma section) also need to be in RAM in the case that the user
   calls them during a ROM operation. */
#ifdef FLASH_API_RX_CFG_ROM_BGO
#pragma section FRAM
#endif

/******************************************************************************
 * Function Name: R_FlashDataAreaBlankCheck
 * Description  : Performs a blank check on a specified data flash block
 *                NOTE1: This function does not have to execute from in RAM. It
 *                       must be in RAM though if FLASH_API_RX_CFG_ROM_BGO is
 *                       enabled and this function is called during a ROM P/E
 *                       operation.
 *                NOTE2: RX610 & RX62x support block and 8 byte checks
 *                       RX630/631/63N support block and 2 byte checks
 *                       RX210         support block and 2 byte checks
 * Arguments    : address -
 *                    The address to check if is blank.
 *                    If the parameter 'size'=='BLANK_CHECK_ENTIRE_BLOCK',
 *                    this should be set to a defined Data Block Number
 *                    ('BLOCK_DB0', 'BLOCK_DB1', etc...) or an address
 *                    in the data flash block.  Either option will work.
 *                    If the parameter 'size'=='BLANK_CHECK_SMALLEST',
 *                    this should be set to an appropriate address boundary
 *                    based upon the smallest blank check size. The smallest
 *                    blank check size is the same as the smallest program
 *                    size for the data flash.
 *                    If the parameter 'size'=='BLANK_CHECK_2_BYTE',
 *                    this should be set to a 2 byte address boundary.
 *                    If the parameter 'size'=='BLANK_CHECK_8_BYTE',
 *                    this should be set to an 8-byte address boundary.
 *                size -
 *                    This specifies if you are checking an 8-byte location,
 *                    2-byte location, or an entire block. You must set this
 *                    to either 'BLANK_CHECK_SMALLEST' or
 *                    'BLANK_CHECK_ENTIRE_BLOCK'. Use of 'BLANK_CHECK_8_BYTE'
 *                    and 'BLANK_CHECK_2_BYTE' has been deprecated but is
 *                    still supported as well.
 * Return Value : FLASH_BLANK -
 *                    (2 or 8 Byte check or non-BGO) Blank
 *                    (Entire Block & BGO) Blank check operation started
 *                FLASH_NOT_BLANK -
 *                    Not Blank
 *                FLASH_FAILURE -
 *                    Operation Failed
 *                FLASH_BUSY -
 *                    Another flash operation is in progress
 *                FLASH_ERROR_ADDRESS -
 *                    Invalid address
 *                FLASH_ERROR_BYTES -
 *                    Incorrect 'size' was submitted
 *                FLASH_ERROR_ALIGNED -
 *                    Address not on programming boundary (only required when
 *                    'size' != BLANK_CHECK_ENTIRE_BLOCK).
 ******************************************************************************/
uint8_t R_FlashDataAreaBlankCheck(uint32_t address, uint8_t size)
{
    /* Declare data flash pointer */
    FCU_BYTE_PTR ptrb;

    /* Declare result container variable */
    uint8_t result;

    /* Declare wait counter variable */
    volatile int32_t wait_cnt;

    /* Check to make sure 'address' is valid. */
    if ((address >= BLOCK_DB0) && (address < (DF_NUM_BLOCKS + BLOCK_DB0)))
    {
        /* Check to see if user sent in a data block number or the
           address.  The function description tells the user to send
           in the block number but in some early examples the address
           was used. To make this work with both versions we detect which
           is sent in below and make it work either way. */

        /* Data flash block sent in. */
        address = g_flash_BlockAddresses[address];
    }
    else if ((address >= DF_ADDRESS) &&
             (address < (DF_ADDRESS + FLASH_API_RX_CFG_DATA_FLASH_SIZE_BYTES)))
    {
        /* Data flash address sent in. */
        if (BLANK_CHECK_SMALLEST == size)
        {
            /* Make sure address is aligned correctly. */
            if (address & (DF_PROGRAM_SIZE_SMALL - 1))
            {
                /* Return address not on a programming boundary */
                return FLASH_ERROR_ALIGNED;
            }
        }
    }
    else
    {
        /* Neither a DF block or DF address were input. */
        return FLASH_ERROR_ADDRESS;
    }

    /* Check to make sure 'size' parameter is valid */
    if ((BLANK_CHECK_ENTIRE_BLOCK != size) && (BLANK_CHECK_SMALLEST != size))
    {
        /* 'size' parameter is not valid. */
        return FLASH_ERROR_BYTES;
    }

    /* Attempt to grab state */
    if (FLASH_SUCCESS != flash_grab_state(FLASH_BLANKCHECK))
    {
        /* Another operation is already in progress */
        return FLASH_BUSY;
    }

    /* Set current FCU mode to Data Flash PE Mode */
    g_current_mode = FLD_PE_MODE;

    /* Enter Data Flash PE mode in the FCU */
    if (FLASH_SUCCESS != enter_pe_mode(address))
    {
        /* Make sure part is in ROM read mode. */
        exit_pe_mode();

        /* Release state */
        flash_release_state();

        /* Return FLASH_FAILURE, operation failure */
        return FLASH_FAILURE;
    }

    /* Set  bit FRDMD (bit 4) in FMODR to 1 */
    FLASH.FMODR.BIT.FRDMD = 1;

    /* Check if smallest check size has been passed */
    if (BLANK_CHECK_SMALLEST == size)
    {
        #ifdef FLASH_API_RX_CFG_DATA_FLASH_BGO
        /* Disable FCU ready interrupt for smallest size checks */
        FLASH.FRDYIE.BIT.FRDYIE = 0;
        #endif

        /* Set data flash pointer to beginning of the memory block */
        ptrb = (FCU_BYTE_PTR)(address & DF_MASK);

        /* Check if the next N bytes are blank (N = DF_PROGRAM_SIZE_SMALL)
           Bits BCADR to the address of the N-byte location to check.
           Set bit BCSIZE in EEPBCCNT to 0. */
        FLASH.DFLBCCNT.WORD = (uint16_t)(address & (DF_BLOCK_SIZE_LARGE - DF_PROGRAM_SIZE_SMALL));
    }
    /* Check entire data block */
    else
    {

        /* Any address in the erasure block */
        ptrb = (FCU_BYTE_PTR)address;

