hirata0517masato/RX621-CMouse/RX621_Cmausu_3rd_white1mm-15mm/r_flash_api_rx.c
        /* Check if the entire block is blank
           Set bit BCSIZE in EEPBCCNT to 1. */
        FLASH.DFLBCCNT.BIT.BCSIZE = 1;
    }

#ifdef FLASH_API_RX_CFG_DATA_FLASH_BGO
    /* Only using BGO on entire block blank checks */
    if (BLANK_CHECK_ENTIRE_BLOCK == size)
    {
        /* Set global address in case we have error and need to reset FCU. */
        g_bgo_flash_addr = address;
    }
#endif

    /* Send commands to FCU */
    *ptrb = 0x71;
    *ptrb = 0xD0;

#ifdef FLASH_API_RX_CFG_DATA_FLASH_BGO
    /* Only using BGO on entire block blank checks */
    if (BLANK_CHECK_ENTIRE_BLOCK == size)
    {
        /* Return, check result later in ISR */
        return FLASH_BLANK;
    }
#endif

    /* Set timeout wait counter value */
    wait_cnt = WAIT_MAX_BLANK_CHECK;

    /* Wait until FCU operation finishes, or a timeout occurs */
    while (0 == FLASH.FSTATR0.BIT.FRDY)
    {
        /* Decrement the wait counter */
        wait_cnt--;

        /* Check if the wait counter has reached zero */
        if (0 == wait_cnt)
        {
            /* Maximum timeout duration for writing to ROM has elapsed -
               assume operation failure and reset the FCU */
            flash_reset();

            /* Return FLASH_FAILURE, operation failure */
            return FLASH_FAILURE;
        }
    }


    /* Reset the FRDMD bit back to 0 */
    FLASH.FMODR.BIT.FRDMD = 0x00;

    /* Check if the 'ILGERR' was set during the command */
    if (1 == FLASH.FSTATR0.BIT.ILGLERR) /* Check 'ILGERR' bit */
    {
        /* Take the FCU out of PE mode */
        exit_pe_mode();

        /* Release state */
        flash_release_state();

        /* Return FLASH_FAILURE, operation failure */
        return FLASH_FAILURE;
    }

    /* (Read the 'BCST' bit (bit 0) in the 'DFLBCSTAT' register
       0=blank, 1=not blank */
    result = (uint8_t)FLASH.DFLBCSTAT.BIT.BCST;

    /* Take the FCU out of PE mode */
    exit_pe_mode();

    /* Release state */
    flash_release_state();

    /* Return (Not Blank/Blank), operation successful */
    if (0 == result)
    {
        /* Block was blank */
        return FLASH_BLANK;
    }
    else
    {
        /* Block was not blank */
        return FLASH_NOT_BLANK;
    }
}
/******************************************************************************
 End of function  R_FlashDataAreaBlankCheck
 ******************************************************************************/

/******************************************************************************
 * Function Name: R_FlashDataAreaAccess
 * Description  : This function is used to allow read and program permissions
 *                to the Data Flash areas.
 *                NOTE1: This function does not have to execute from in RAM. It
 *                       must be in RAM though if FLASH_API_RX_CFG_ROM_BGO is
 *                       enabled and this function is called during a ROM P/E
 *                       operation.
 * Arguments    : read_en_mask -
 *                    Bitmasked value. Bits 0-3 represents each Data
 *                    Blocks 0-3 (respectively).
 *                    '0'=no Read access.
 *                    '1'=Allows Read by CPU
 *                write_en_mask -
 *                    Bitmasked value. Bits 0-3 represents each Data
 *                    Blocks 0-3 (respectively).
 *                    '0'=no Erase/Write access.
 *                    '1'=Allows Erase/Write by FCU
 * Return Value : none
 ******************************************************************************/
void R_FlashDataAreaAccess(uint16_t read_en_mask, uint16_t write_en_mask)
{
#if defined(FLASH_MCU_RX610)

    /* Set Read access for the Data Flash blocks */
    FLASH.DFLRE.WORD = (uint16_t)(0x2D00 | (read_en_mask & 0x000F));

    /* Set Erase/Program access for the Data Flash blocks */
    FLASH.DFLWE.WORD = (uint16_t)(0x1E00 | (write_en_mask & 0x000F));

#else
    /* Used for making sure select bits are not set. */
    uint16_t temp_mask = 0x00FF;


#if FLASH_API_RX_CFG_DATA_FLASH_SIZE_BYTES == 8192
    /* Mask off bits 4-7 to make sure they are 0. */
    temp_mask = 0x000F;
#endif

    /* Set Read access for the Data Flash blocks DB0-DB7 */
    FLASH.DFLRE0.WORD = (uint16_t)(0x2D00 | (read_en_mask & temp_mask));

    /* Set Erase/Program access for the Data Flash blocks DB0-DB7 */
    FLASH.DFLWE0.WORD = (uint16_t)(0x1E00 |  (write_en_mask & temp_mask));

#if FLASH_API_RX_CFG_DATA_FLASH_SIZE_BYTES > 16384
    /* Set Read access for the Data Flash blocks DB8-DB15 */
    FLASH.DFLRE1.WORD = (uint16_t)(0xD200 | ((read_en_mask >> 8) & 0x00FF));

    /* Set Erase/Program access for the Data Flash blocks DB8-DB15 */
    FLASH.DFLWE1.WORD = (uint16_t)(0xE100 |  ((write_en_mask >> 8) & 0x00FF));
#endif

#endif
}
/******************************************************************************
 End of function  R_FlashDataAreaAccess
 ******************************************************************************/

/******************************************************************************
 * Function Name: R_FlashGetStatus
 * Description  : Returns the current state of the flash
 *                NOTE1: This function does not have to execute from in RAM. It
 *                       must be in RAM though if FLASH_API_RX_CFG_ROM_BGO is
 *                       enabled and this function is called during a ROM P/E
 *                       operation.
 * Arguments    : none
 * Return Value : FLASH_SUCCESS -
 *                    Flash is ready to use
 *                FLASH_BUSY -
 *                    Flash is busy with another operation
 ******************************************************************************/
uint8_t R_FlashGetStatus(void)
{
    /* Return flash status */
    if (FLASH_READY == g_flash_state)
    {
        return FLASH_SUCCESS;
    }
    else
    {
        return FLASH_BUSY;
    }
}
/******************************************************************************
 End of function  R_FlashGetStatus
 ******************************************************************************/

