hirata0517masato/RX621-CMouse/RX621_Cmausu_3rd_white1mm-15mm/r_flash_api_rx.c
/******************************************************************************
 * Function Name: flash_grab_state
 * Description  : Attempt to grab the flash state to perform an operation
 *                NOTE1: This function does not have to execute from in RAM. It
 *                       must be in RAM though if FLASH_API_RX_CFG_ROM_BGO is
 *                       enabled and this function is called during a ROM P/E
 *                       operation.
 * Arguments    : new_state -
 *                    Which state to attempt to transition to
 * Return Value : FLASH_SUCCESS -
 *                    State was grabbed
 *                FLASH_BUSY -
 *                    Flash is busy with another operation
 ******************************************************************************/
static uint8_t flash_grab_state(flash_states_t new_state)
{
    /* Check to see if lock was successfully taken */
    if (FLASH_READY == g_flash_state)
    {
        /* Lock taken, we can change state */
        g_flash_state = new_state;

        /* Return success */
        return FLASH_SUCCESS;
    }
    else
    {
        /* Another operation is on-going */
        return FLASH_BUSY;
    }
}
/******************************************************************************
 End of function  flash_grab_state
 ******************************************************************************/

/******************************************************************************
 * Function Name: flash_release_state
 * Description  : Release state so another flash operation can take place
 *                NOTE1: This function does not have to execute from in RAM. It
 *                       must be in RAM though if FLASH_API_RX_CFG_ROM_BGO is
 *                       enabled and this function is called during a ROM P/E
 *                       operation.
 * Arguments    : none
 * Return Value : none
 ******************************************************************************/
static void flash_release_state(void)
{
    /* Set current FCU mode to READ */
    g_current_mode = READ_MODE;

    /* Done with programming */
    g_flash_state = FLASH_READY;

}
/******************************************************************************
 End of function  flash_release_state
 ******************************************************************************/

/******************************************************************************
 * Function Name: flash_valid_block_check
 * Description  : Checks to see if the input block is actually a valid block.
 *                This function checks against the actual memory size of the
 *                MCU, not against the maximum. This means that if a memory
 *                block is sent in that does not exist for this part, but does
 *                for a larger memory variant of this MCU, this function will
 *                return an error.
 *                NOTE1: This function does not have to execute from in RAM. It
 *                       must be in RAM though if FLASH_API_RX_CFG_ROM_BGO is
 *                       enabled and this function is called during a ROM P/E
 *                       operation.
 * Arguments    : none
 * Return Value : true -
 *                    Block is valid.
 *                false -
 *                    Block is not valid.
 ******************************************************************************/
static bool flash_valid_block_check(uint32_t block)
{
    bool err;

    err = true;

    if (block >= BLOCK_DB0)
    {
        /* Data flash block sent in. Verify this block exists. */
        if (block >= (BLOCK_DB0 + DF_NUM_BLOCKS))
        {
            err = false;
        }
    }
    else
    {
        /* ROM block sent in. */
        if (block >= ROM_NUM_BLOCKS)
        {
            err = false;
        }
    }

    return err;
}
/******************************************************************************
 End of function  flash_valid_block_check
 ******************************************************************************/

#ifndef  FLASH_API_RX_CFG_IGNORE_LOCK_BITS
/******************************************************************************
 * Function Name: R_FlashSetLockBitProtection
 * Description  : Enables or disables lock bit protection.
 *                NOTE1: This function does not have to execute from in RAM. It
 *                       must be in RAM though if FLASH_API_RX_CFG_ROM_BGO is
 *                       enabled and this function is called during a ROM P/E
 *                       operation.
 * Arguments    : lock_bit -
 *                    Boolean, whether to enable or disable lock bit
 *                    protection (true = enabled, false = disabled)
 * Return Value : FLASH_SUCCESS -
 *                    Operation Successful
 *                FLASH_BUSY -
 *                    Another flash operation is in progress
 ******************************************************************************/
uint8_t R_FlashSetLockBitProtection(uint32_t lock_bit)
{
    /* Attempt to grab state */;
    if (FLASH_SUCCESS != flash_grab_state(FLASH_LOCK_BIT))
    {
        /* Another operation is already in progress */
        return FLASH_BUSY;
    }

    /* Enable or disable? */
    g_lock_bit_protection = lock_bit;

    /* Release state */
    flash_release_state();

    /* Return success */
    return FLASH_SUCCESS;
}
/******************************************************************************
 End of function  R_FlashSetLockBitProtection
 ******************************************************************************/
#endif

#if defined(FLASH_API_RX_CFG_DATA_FLASH_BGO) || defined(FLASH_API_RX_CFG_ROM_BGO)
/******************************************************************************
 * Function Name: flash_ready_isr
 * Description  : ISR that is called when FCU is done with flash operation
 *                NOTE: This function MUST execute from RAM only when
 *                      FLASH_API_RX_CFG_ROM_BGO is enabled.
 * Arguments    : none
 * Return Value : none
 ******************************************************************************/
#pragma interrupt flash_ready_isr(vect=VECT(FCU, FRDYI))
void flash_ready_isr(void)
{
    /* Local variables */
    uint32_t num_byte_to_write;
    uint8_t  ret;
#ifdef FLASH_API_RX_CFG_FLASH_TO_FLASH
    uint32_t i;
#endif

    /* Check for any errors */
    if ((1 == FLASH.FSTATR0.BIT.ILGLERR) ||
        (1 == FLASH.FSTATR0.BIT.ERSERR) ||
        (1 == FLASH.FSTATR0.BIT.PRGERR))
    {
        /* Leave Program/Erase Mode and clear any error flags */
        exit_pe_mode();

        /* Release flash state */
        flash_release_state();

        /* Operation failure, use callback function to alert user */
        FlashError();

        /* Exit ISR */
        return;
    }

