hirata0517masato/RX621-CMouse/RX621_Cmausu_3rd_white1mm-15mm/r_flash_api_rx.c
    /* Check state and see if anything else needs to be done */
    if (FLASH_ERASING == g_flash_state)
    {
        /* Erase is done */
#if defined(DF_GROUPED_BLOCKS)
        /* If we are erasing data flash then we need to see if all requested
           blocks are erased. */
        if (FLD_PE_MODE == g_current_mode)
        {
            /* Check to see if there are more bytes to erase. */
            if (0 < g_bgo_bytes)
            {

                /* Send FCU command to erase block */
                ret = flash_erase_command((FCU_BYTE_PTR)g_bgo_flash_addr);

                /* Advance pointer to next block */
                g_bgo_flash_addr += DF_ERASE_BLOCK_SIZE;

                /* Subtract off bytes erased */
                g_bgo_bytes -= DF_ERASE_BLOCK_SIZE;

                /* Only continue if last command was successful */
                if (FLASH_SUCCESS == ret)
                {
                    /* Exit ISR */
                    return;
                }
            }
        }
#endif

        /* Leave Program/Erase Mode */
        exit_pe_mode();

        /* Release flash state */
        flash_release_state();

        /* Flash operation finished callback function */
        FlashEraseDone();
    }
#ifdef FLASH_API_RX_CFG_DATA_FLASH_BGO
    else if (FLASH_BLANKCHECK == g_flash_state)
    {
        /* Blank check finished, check result */

        /* Reset the FRDMD bit back to 0 */
        FLASH.FMODR.BIT.FRDMD = 0x00;

        /* (Read the 'BCST' bit (bit 0) in the 'DFLBCSTAT' register
           0=blank, 1=not blank */
        ret = (uint8_t)FLASH.DFLBCSTAT.BIT.BCST;

        /* Take the FCU out of PE mode */
        exit_pe_mode();

        /* Release flash state */
        flash_release_state();

        /* Return result, 0 means blank, 1 means not blank */
        if (0 == ret)
        {
            FlashBlankCheckDone(FLASH_BLANK);
        }
        else
        {
            FlashBlankCheckDone(FLASH_NOT_BLANK);
        }
    }
#endif
    else if (FLASH_WRITING == g_flash_state)
    {
        /* Iterate while there are still bytes remaining to write */
        if (g_bgo_bytes > 0)
        {
            /* Get maximum programming size that can currently be used. */
            num_byte_to_write = flash_get_program_size(g_bgo_bytes, g_bgo_flash_addr);

#ifdef FLASH_API_RX_CFG_FLASH_TO_FLASH
            /* Check to see if we need to buffer more data */
            if (1 == g_flash_to_flash_op)
            {
                /* We must leave PE mode to transfer next buffer to RAM */
                exit_pe_mode();

                /* Copy over next bytes to write */
                for (i = 0; i < num_byte_to_write; i++)
                {
                    /* Copy over each byte */
                    g_temp_array[i] = *((uint8_t *)(g_bgo_buffer_addr+i));
                }

                /* Re-enter PE mode, check if operation is successful */
                if (FLASH_SUCCESS != enter_pe_mode(g_bgo_flash_addr))
                {
                    /* Leave Program/Erase Mode and clear any error flags */
                    exit_pe_mode();

                    /* Release flash state */
                    flash_release_state();

                    /* Operation failure, use callback function to alert user */
                    FlashError();

                    /* Exit ISR */
                    return;
                }
            }
#endif

            /* Are we writing DF or ROM? */
            if (FLD_PE_MODE == g_current_mode)
            {
                /* Writing DF */
                /* Call the Programming function again for next bytes */
#ifdef FLASH_API_RX_CFG_FLASH_TO_FLASH
                if (1 == g_flash_to_flash_op)
                {
                    ret = data_flash_write( g_bgo_flash_addr,
                                            (uint32_t)&g_temp_array[0],
                                            num_byte_to_write);
                }
                else
                {
                    ret = data_flash_write( g_bgo_flash_addr,
                                            g_bgo_buffer_addr,
                                            num_byte_to_write);
                }
#else
                ret = data_flash_write( g_bgo_flash_addr,
                                        g_bgo_buffer_addr,
                                        num_byte_to_write);
#endif
            }
            else
            {
                /* Writing ROM */
                /* Call the Programming function */
#ifdef FLASH_API_RX_CFG_FLASH_TO_FLASH
                if (1 == g_flash_to_flash_op)
                {
                    /* Use RAM array */
                    ret = rom_write(g_bgo_flash_addr,
                                    (uint32_t)&g_temp_array[0],
                                    num_byte_to_write);
                }
                else
                {
                    /* Go as usual */
                    ret = rom_write(g_bgo_flash_addr,
                                    g_bgo_buffer_addr,
                                    num_byte_to_write);
                }
#else
                ret = rom_write(g_bgo_flash_addr,
                                g_bgo_buffer_addr,
                                num_byte_to_write);
#endif
            }

            /* Check the result for errors */
            if (FLASH_SUCCESS != ret)
            {
                /* Error detected during programming, stop and return */
                /* Leave Program/Erase Mode and clear any error flags */
                exit_pe_mode();

                /* Release flash state */
                flash_release_state();

                /* Operation failure, use callback function to alert user */
                FlashError();

                /* Exit ISR */
                return;
            }

            /* Increment the flash address and the buffer address by the size
               of the transfer thats just completed */
            g_bgo_flash_addr += num_byte_to_write;
            g_bgo_buffer_addr += num_byte_to_write;

            /* Decrement the number of bytes remaining by the size of the last
               flash write */
            g_bgo_bytes -= num_byte_to_write;

