hirata0517masato/RX621-CMouse/RX621_Cmausu_3rd_white1mm-15mm/r_flash_api_rx.c
        }
        else
        {
            /* Leave Program/Erase Mode */
            exit_pe_mode();

            /* Release flash state */
            flash_release_state();

            /* Flash operation finished callback function */
            FlashWriteDone();
        }

    }
    else
    {
        /* Error, should never get here */
        nop();
    }
}
/******************************************************************************
 End of function  flash_ready_isr
 ******************************************************************************/

#endif /* defined(FLASH_API_RX_CFG_DATA_FLASH_BGO) || defined(FLASH_API_RX_CFG_ROM_BGO) */

#ifdef FLASH_API_RX_CFG_ENABLE_ROM_PROGRAMMING
#pragma section FRAM
#endif

/******************************************************************************
 * Function Name: rom_write
 * Description  : Write bytes to ROM Area Flash.
 *                NOTE: This function MUST execute from in RAM.
 * Arguments    : address -
 *                    ROM address of where to write to
 *                data -
 *                    Pointer to the data to write
 *                size -
 *                    The size of the data to write. Must be set to
 *                    either a supported write size of the MCU.
 * Return Value : FLASH_SUCCESS -
 *                    Operation Successful
 *                FLASH_FAILURE -
 *                    Operation Failed
 ******************************************************************************/
static uint8_t rom_write(uint32_t address, uint32_t data, uint32_t size)
{
/* If ROM programming is not enabled then do not compile this code as it is
   not needed. */
#ifdef FLASH_API_RX_CFG_ENABLE_ROM_PROGRAMMING

    /* Declare iteration loop count variable */
    volatile uint32_t i;
    /* Declare wait counter variable */
    volatile int32_t  wait_cnt;

    /* Writes are done 16-bit at a time, scale 'size' argument */
    size = size >> 1;

    /* Write the FCU Program command */
    *(FCU_BYTE_PTR)address = 0xE8;
    *(FCU_BYTE_PTR)address = size;

    /* Write 'size' bytes into flash, 16-bits at a time */
    for (i = 0; i < size; i++)
    {
        /* Copy data from source address to destination ROM */
        *(FCU_WORD_PTR)address = *(uint16_t *)data;

        /* Increment destination address by 2 bytes */
        data += 2;
    }

    /* Write the final FCU command for programming */
    *(FCU_BYTE_PTR)address = 0xD0;

#if !defined(FLASH_API_RX_CFG_ROM_BGO)
    /* Set timeout wait counter value */
    wait_cnt = WAIT_MAX_ROM_WRITE;


    /* Wait until FCU operation finishes, or a timeout occurs */
    while (0 == FLASH.FSTATR0.BIT.FRDY)
    {
        /* Decrement the wait counter */
        wait_cnt--;

        /* Check if the wait counter has reached zero */
        if (0 == wait_cnt)
        {
            /* Maximum timeout duration for writing to ROM has elapsed -
               assume operation failure and reset the FCU */
            flash_reset();

            /* Return FLASH_FAILURE, operation failure */
            return FLASH_FAILURE;
        }
    }
#endif


    /* Check for illegal command or programming errors */
    if ((1 == FLASH.FSTATR0.BIT.ILGLERR) || (1 == FLASH.FSTATR0.BIT.PRGERR))
    {
#if defined(FLASH_API_RX_CFG_ROM_BGO)
        /* If ROM BGO is enabled then the flash ready interrupt may already
         * have fired by now if a ROM access violation occurred. The ISR
         * would clear the error and take the FCU out of PE state. Another
         * ROM AE violation could occur when the interrupt returns because
         * the code above is still attempting to write to ROM. To clear this
         * error the FCU will need to be put back into PE state so that
         * we can perform a status clear.
         */
        if (FLASH_READY == g_flash_state)
        {
            /* The only reason the state would be FLASH_READY is if the
             * interrupt had already fired.
             */
            g_current_mode = ROM_PE_MODE;

            enter_pe_mode(address);
        }
#endif

        /* Return FLASH_FAILURE, operation failure */
        return FLASH_FAILURE;
    }

#else
    /* These macros are used to remove warnings from the compiler that the
     * parameters are never referenced. Using this macro will not actually
     * generate code.
     */
    INTERNAL_NOT_USED(address);
    INTERNAL_NOT_USED(data);
    INTERNAL_NOT_USED(size);

#endif

    /* If ROM programming is not enabled then this function will always just
       return FLASH_SUCCESS. This is okay because this function will never
       actually be called. The API write function will return an error when
       a ROM address is entered for programming. */

    /* Return FLASH_SUCCESS, operation successful */
    return FLASH_SUCCESS;
}
/******************************************************************************
 End of function  rom_write
 ******************************************************************************/

/******************************************************************************
 * Function Name: enter_pe_mode
 * Description  : Puts the FCU into program/erase mode.
 *                NOTE: This function MUST execute from in RAM for 'ROM Area'
 *                programming, but if you are ONLY doing Data Flash programming,
 *                this function can reside and execute in Flash.
 * Arguments    : flash_addr -
 *                    The programming/erasure address
 *                bytes -
 *                    The number of bytes you are writing (if you are writing).
 * Return Value : FLASH_SUCCESS -
 *                    Operation Successful
 *                FLASH_FAILURE -
 *                    Operation Failed
 ******************************************************************************/
static uint8_t enter_pe_mode(uint32_t flash_addr)
{
    /* Used for timeout on FENTRYR write/read. */
    volatile int32_t wait_cnt;

    /* If FCU firmware has already been transferred to FCU RAM,
       no need to do it again */
    if (!g_fcu_transfer_complete)
    {
        /* Initialize the FCU, and store operation result in result variable */
        /* Check if FCU initialization was successful */
        if (FLASH_SUCCESS != flash_init())
        {
            /* FCU initialization failed - return operation failure */
            return FLASH_FAILURE;
        }
    }

    /* FENTRYR must be 0x0000 before bit FENTRY0 or FENTRYD can be set to 1 */
    FLASH.FENTRYR.WORD = 0xAA00;

