hirata0517masato/RX621-CMouse/RX621_Cmausu_3rd_white1mm-15mm/r_flash_api_rx.c
    /* Initialize timeout for FENTRYR being written. */
    wait_cnt = FLASH_FENTRYR_TIMEOUT;

    /* Read FENTRYR to ensure it has been set to 0. Note that the top byte
       of the FENTRYR register is not retained and is read as 0x00. */
    while(0x0000 != FLASH.FENTRYR.WORD)
    {
        /* Wait until FENTRYR is 0 unless timeout occurs. */
        if (wait_cnt-- <= 0)
        {
            /* This should not happen. FENTRYR getting written to 0 should
               only take 2-4 PCLK cycles. */
            return FLASH_FAILURE;
        }
    }

    /* Check if FCU mode is set to ROM PE */
    if (ROM_PE_MODE == g_current_mode)
    {
#if defined(FLASH_API_RX_CFG_ROM_BGO)
        /* Don't enable flash interrupts if programming lock bits */
        if (FLASH_LOCK_BIT != g_flash_state)
        {
            /* Re-enable the FRDYI interrupt */
            FLASH.FRDYIE.BIT.FRDYIE = 1;
        }
#else
        /* Disable the FRDYI interrupt */
        FLASH.FRDYIE.BIT.FRDYIE = 0;
#endif

        /* Check which area of flash this address is in */
        if (flash_addr >= ROM_AREA_0)
        {
            /* Area 0 */
            /* Enter ROM PE mode for ROM Area 0 */
            FLASH.FENTRYR.WORD = 0xAA01;
        }
#if defined(ROM_AREA_1)
        else if ((flash_addr < ROM_AREA_0) && (flash_addr >= ROM_AREA_1))
        {
            /* Area 1 */
            /* Enter ROM PE mode for ROM Area 1 */
            FLASH.FENTRYR.WORD = 0xAA02;
        }
#endif
#if defined(ROM_AREA_2)
        else if ((flash_addr < ROM_AREA_1) && (flash_addr >= ROM_AREA_2))
        {
            /* Area 2 */
            /* Enter ROM PE mode for ROM Area 2 */
            FLASH.FENTRYR.WORD = 0xAA04;
        }
#endif
#if defined(ROM_AREA_3)
        else
        {
            /* Area 3 */
            /* Enter ROM PE mode for ROM Area 3 */
            FLASH.FENTRYR.WORD = 0xAA08;
        }
#endif

    }
    /* Check if FCU mode is set to data flash PE */
    else if (FLD_PE_MODE == g_current_mode)
    {
#if defined(FLASH_API_RX_CFG_DATA_FLASH_BGO)
        /* Re-enable the FRDYI interrupt */
        FLASH.FRDYIE.BIT.FRDYIE = 1;
#else
        /* Disable the FRDYI interrupt */
        FLASH.FRDYIE.BIT.FRDYIE = 0;
#endif

        /* Set FENTRYD bit(Bit 7) and FKEY (B8-15 = 0xAA) */
        FLASH.FENTRYR.WORD = 0xAA80;

        /*  First clear the FCU's status before doing Data Flash programming.
            This is to clear out any previous errors that may have occured.
            For example, if you attempt to read the Data Flash area
            before you make it readable using R_FlashDataAreaAccess(). */
        data_flash_status_clear();

    }
    /* Catch-all for invalid FCU mode */
    else
    {
        /* Invalid value of 'g_current_mode' */
        return FLASH_FAILURE;
    }

    /* Enable Write/Erase of ROM/Data Flash */
    FLASH.FWEPROR.BYTE = 0x01;

    /* Check for FCU error */
    if (   (1 == FLASH.FSTATR0.BIT.ILGLERR)
        || (1 == FLASH.FSTATR0.BIT.ERSERR)
        || (1 == FLASH.FSTATR0.BIT.PRGERR)
        || (1 == FLASH.FSTATR1.BIT.FCUERR))
    {
        /* Return FLASH_FAILURE, operation failure */
        return FLASH_FAILURE;
    }

    /* Check to see if peripheral clock notification command is needed */
    if (0 == g_fcu_pclk_command)
    {
        /* Disable FCU interrupts, so interrupt will not trigger after
           peripheral clock notification command */
        FLASH.FRDYIE.BIT.FRDYIE = 0;

        /* Inform FCU of flash clock speed, check if operation is succesful */
        if (0 != notify_peripheral_clock((FCU_BYTE_PTR) flash_addr))
        {
            /* Return FLASH_FAILURE, operation failure */
            return FLASH_FAILURE;
        }

        /* Only re-enable flash ready interrupt if using BGO */
#ifdef FLASH_API_RX_CFG_DATA_FLASH_BGO
        if (FLD_PE_MODE == g_current_mode)
        {
            /* Re-enable the FRDYI interrupt */
            FLASH.FRDYIE.BIT.FRDYIE = 1;
        }
#endif
#ifdef FLASH_API_RX_CFG_ROM_BGO
        if (ROM_PE_MODE == g_current_mode)
        {
            /* Don't enable flash interrupts if programming lock bits */
            if(FLASH_LOCK_BIT != g_flash_state)
            {
                /* Re-enable the FRDYI interrupt */
                FLASH.FRDYIE.BIT.FRDYIE = 1;
            }
        }
#endif

        /* No need to notify FCU of clock supplied to flash again */
        g_fcu_pclk_command = 1;
    }

    /* Return FLASH_SUCCESS, operation successful */
    return FLASH_SUCCESS;
}
/******************************************************************************
 End of function enter_pe_mode
 ******************************************************************************/

/******************************************************************************
 * Function Name: exit_pe_mode
 * Description  : Takes the FCU out of program/erase mode.
 *                NOTE: This function MUST execute from in RAM for 'ROM Area'
 *                programming, but if you are ONLY doing Data Flash
 *                programming, this function can reside and execute in Flash.
 * Arguments    : none
 * Return Value : none
 ******************************************************************************/
static void exit_pe_mode(void)
{
    /* Declare wait timer count variable */
    volatile int32_t wait_cnt;

    /* Declare address pointer */
    FCU_BYTE_PTR p_addr;

    /* Set wait timer count duration */
    wait_cnt = WAIT_MAX_ERASE;

    /* Iterate while loop whilst FCU operation is in progress */
    while (0 == FLASH.FSTATR0.BIT.FRDY)
    {
        /* Decrement wait timer count variable */
        wait_cnt--;

        /* Check if wait timer count value has reached zero */
        if (0 == wait_cnt)
        {
            /* Timeout duration has elapsed, assuming operation failure and
               resetting the FCU */
            flash_reset();

            /* Break from the while loop prematurely */
            break;
        }
    }

    /* Check FSTATR0 and execute a status register clear command if needed */
    if (   (1 == FLASH.FSTATR0.BIT.ILGLERR)
        || (1 == FLASH.FSTATR0.BIT.ERSERR)
        || (1 == FLASH.FSTATR0.BIT.PRGERR))
    {

        /* Set pointer to command area  */
        if (0x0001 == FLASH.FENTRYR.WORD)
        {
            /* Area 0 */
            p_addr = (FCU_BYTE_PTR) (g_flash_BlockAddresses[0]);
        }
#if defined(ROM_AREA_1)
        else if (0x0002 == FLASH.FENTRYR.WORD)
        {
            /* Area 1 */
            p_addr = (FCU_BYTE_PTR) (ROM_AREA_0 - ROM_PROGRAM_SIZE);
        }
#endif
#if defined(ROM_AREA_2)
        else if (0x0004 == FLASH.FENTRYR.WORD)
        {
            /* Area 2 */
            p_addr = (FCU_BYTE_PTR) (ROM_AREA_1 - ROM_PROGRAM_SIZE);
        }
#endif
#if defined(ROM_AREA_3)
        else if (0x0008 == FLASH.FENTRYR.WORD)
        {
            /* Area 3 */
            p_addr = (FCU_BYTE_PTR) (ROM_AREA_2 - ROM_PROGRAM_SIZE);
        }
#endif
        else if (0x0080 == FLASH.FENTRYR.WORD)
        {
            /* Data flash area */
            p_addr = (FCU_BYTE_PTR) (DF_ADDRESS);
        }
        else
        {
            /* Normally, this process does not run.
            If this function is called in read mode with an error condition,
            it sets this address and transitions to data flash P/E mode
            to send status clear command. */

