hirata0517masato/RX621-CMouse/RX621_Cmausu_3rd_white1mm-15mm/r_flash_api_rx.c
            /* Data flash area */
            p_addr = (FCU_BYTE_PTR) (DF_ADDRESS);

            /* Enter data flash P/E mode */
            /* Set FENTRYD bit(Bit 7) and FKEY (B8-15 = 0xAA) */
            FLASH.FENTRYR.WORD = 0xAA80;

        }

            /* Clear ILGLERR */
        if (1 == FLASH.FSTATR0.BIT.ILGLERR)
        {
            /* FASTAT must be set to 0x10 before the status clear command
             can be successfully issued  */
            if (0x10 != FLASH.FASTAT.BYTE)
            {
                /* Set the FASTAT register to 0x10 so that a status clear
                 command can be issued */
                FLASH.FASTAT.BYTE = 0x10;
            }
        }

        /* Send status clear command to FCU */
        *p_addr = 0x50;
    }

    /* Enter ROM Read mode */
    FLASH.FENTRYR.WORD = 0xAA00;

    /* Initialize timeout for FENTRYR being written. */
    wait_cnt = FLASH_FENTRYR_TIMEOUT;

    /* Read FENTRYR to ensure it has been set to 0. Note that the top byte
       of the FENTRYR register is not retained and is read as 0x00. */
    while (0x0000 != FLASH.FENTRYR.WORD)
    {
        /* Wait until FENTRYR is 0 unless timeout occurs. */
        if (wait_cnt-- <= 0)
        {
            /* This should not happen. FENTRYR getting written to 0 should
               only take 2-4 PCLK cycles. Could add a call to FlashError()
               here if user wants to process this. */
            break;
        }
    }

    /* Disable the FRDYI interrupt */
    FLASH.FRDYIE.BIT.FRDYIE = 0;

    /* Clear FRDYI interrupt request flag */
    IR(FCU, FRDYI) = 0;

    /* Flash write/erase disabled */
    FLASH.FWEPROR.BYTE = 0x02;

}
/******************************************************************************
 End of function  exit_pe_mode
 ******************************************************************************/

/******************************************************************************
 * Function Name: R_FlashErase
 * Description  : Erases an entire flash block.
 *                NOTE: This function MUST execute from in RAM for 'ROM Area'
 *                programming, but if you are ONLY doing Data Flash programming,
 *                this function can reside and execute in Flash.
 * Arguments    : block -
 *                    The block number to erase (BLOCK_0, BLOCK_1, etc...)
 * Return Value : FLASH_SUCCESS -
 *                    Operation Successful
 *                FLASH_FAILURE -
 *                    Operation Failed
 *                FLASH_BUSY -
 *                    Another flash operation is in progress
 *                FLASH_ERROR_ADDRESS -
 *                    Invalid block input.
 ******************************************************************************/
uint8_t R_FlashErase(uint32_t block)
{
    /* Declare address pointer */
    uint32_t p_addr;
    /* Declare erase operation result container variable */
    uint8_t  result = FLASH_SUCCESS;
    /*  Set which P / E mode is ROM or data flash */
#if defined(FLASH_API_RX_CFG_DATA_FLASH_BGO) || defined(FLASH_API_RX_CFG_ROM_BGO) || defined(DF_GROUPED_BLOCKS)
    uint8_t  current_mode = READ_MODE;
#endif

    /* Make sure valid block was input. */
    if (false == flash_valid_block_check(block))
    {
        return FLASH_ERROR_ADDRESS;
    }

    /* Do we want to erase a Data Flash block or ROM block? */
    if (block >= BLOCK_DB0)
    {
        /* Set current FCU mode to data flash PE */
        g_current_mode = FLD_PE_MODE;
#if defined(FLASH_API_RX_CFG_DATA_FLASH_BGO) || defined(FLASH_API_RX_CFG_ROM_BGO) || defined(DF_GROUPED_BLOCKS)
        current_mode = FLD_PE_MODE;
#endif
    }
    else
    {
#if defined(FLASH_API_RX_CFG_ENABLE_ROM_PROGRAMMING)
        /* Set current FCU mode to ROM PE */
        g_current_mode = ROM_PE_MODE;
#if defined(FLASH_API_RX_CFG_DATA_FLASH_BGO) || defined(FLASH_API_RX_CFG_ROM_BGO) || defined(DF_GROUPED_BLOCKS)
        current_mode = ROM_PE_MODE;
#endif
#else
        /* ROM operations are not enabled! Enable them in r_flash_api_rx_config.h */
        return FLASH_FAILURE;
#endif
    }

    /* Attempt to grab state */
    if (FLASH_SUCCESS != flash_grab_state(FLASH_ERASING))
    {
        /* Another operation is already in progress */
        return FLASH_BUSY;
    }

    /* Erase Command Address */
    p_addr = g_flash_BlockAddresses[block];

    /* Enter ROM PE mode, check if operation successful */
    if (FLASH_SUCCESS != enter_pe_mode(p_addr))
    {
        /* Make sure part is in ROM read mode. */
        exit_pe_mode();

        /* Release state */
        flash_release_state();

        /* Return FLASH_FAILURE, operation failure */
        return FLASH_FAILURE;
    }

#ifdef FLASH_API_RX_CFG_IGNORE_LOCK_BITS
    /* Cancel the ROM Protect feature
       NOTE: If you are using block locking feature to protect your data,
       then comment out 'FLASH_API_RX_CFG_IGNORE_LOCK_BITS' in r_flash_api_rx_config.h */
    FLASH.FPROTR.WORD = 0x5501;
#else
    /* Only disable lock bit protection if user has specified to
       do so earlier */
    if (false == g_lock_bit_protection)
    {
        /* Cancel the ROM Protect feature */
        FLASH.FPROTR.WORD = 0x5501;
    }
#endif


#if defined(FLASH_API_RX_CFG_ROM_BGO)
    if (ROM_PE_MODE == current_mode)
    {
        /* Set global variable in case an error occurs and it needs to be
         * cleared in the flash ready interrupt later. */
        g_bgo_flash_addr = p_addr;
    }
#endif


#if defined(DF_GROUPED_BLOCKS)
    /* NOTE:
       Some RX MCUs (e.g. RX63N) actually has 1024 x 32 byte blocks instead of
       the 16 x 2Kbyte blocks defined in port file. These are grouped
       into 16 blocks to make it easier for the user to delete larger sections
       of the data flash at once. The user can still delete individual blocks
       but they will need to use the new flash erase function that takes
       addresses instead of blocks. For reference, the 2KB blocks defined
       are called 'fake' blocks. */
    if (FLD_PE_MODE == current_mode)
    {

        /* Calculate how many bytes to erase */
        int32_t bytes_to_erase = (int32_t)
                                 (g_flash_BlockAddresses[BLOCK_DB1] -
                                  g_flash_BlockAddresses[BLOCK_DB0]);


