hirata0517masato/RX621-CMouse/RX621_Cmausu_3rd_white1mm-15mm/r_flash_api_rx.c
#if defined(FLASH_API_RX_CFG_DATA_FLASH_BGO)
            /* Set global variables so that erase can continue in ISR. */
        g_bgo_flash_addr = p_addr + DF_ERASE_BLOCK_SIZE;
        g_bgo_bytes      = bytes_to_erase - DF_ERASE_BLOCK_SIZE;
#endif


        /* Erase real data flash blocks until the 'fake' block is erased .*/
        while (0 < bytes_to_erase)
        {

            /* Send FCU command to erase block */
            result = flash_erase_command((FCU_BYTE_PTR)p_addr);

#if defined(FLASH_API_RX_CFG_DATA_FLASH_BGO)
            /* Return, check result and continue erasure later in ISR */
            return FLASH_SUCCESS;
#endif

            /* Advance pointer to next block */
            p_addr += DF_ERASE_BLOCK_SIZE;

            /* Subtract off bytes erased */
            bytes_to_erase -= DF_ERASE_BLOCK_SIZE;

        }
    }
    else
    {
        /* This is a ROM block erase */
        /* Send FCU command to erase block */
        result = flash_erase_command((FCU_BYTE_PTR)p_addr);
    }
#else

    /* Send FCU command to erase block */
    result = flash_erase_command((FCU_BYTE_PTR)p_addr);

#endif

#if defined(FLASH_API_RX_CFG_ROM_BGO)
    if (ROM_PE_MODE == current_mode)
    {
        /* Return, check result later in ISR */
        return FLASH_SUCCESS;
    }
#endif

#if defined(FLASH_API_RX_CFG_DATA_FLASH_BGO)
    if (FLD_PE_MODE == current_mode)
    {
        /* Return, check result later in ISR */
        return FLASH_SUCCESS;
    }
#endif

    /* Leave Program/Erase Mode */
    exit_pe_mode();

    /* Release state */
    flash_release_state();

    /* Return erase result */
    return result;
}
/******************************************************************************
 End of function  R_FlashErase
 ******************************************************************************/

#if defined(DF_GROUPED_BLOCKS)
/******************************************************************************
 * Function Name: R_FlashEraseRange
 * Description  : Erases blocks starting at an address and stopping when the
 *                number of bytes to erase has been reached.
 *                NOTE: This function is currently only for data flash blocks
 *                on RX MCUs.
 *                NOTE: This function MUST execute from in RAM for 'ROM Area'
 *                programming, but if you are ONLY doing Data Flash programming,
 *                this function can reside and execute in Flash.
 * Arguments    : start_addr -
 *                    The address of where to start erasing. Must be on
 *                    erase boundary.
 *                bytes -
 *                    The numbers of bytes to erase. Must be multiple of
 *                    erase size.
 * Return Value : FLASH_SUCCESS -
 *                    Operation Successful
 *                FLASH_FAILURE -
 *                    Operation Failed
 *                FLASH_ERROR_ALIGNED -
 *                    Flash address was not on correct boundary
 *                FLASH_BUSY -
 *                    Another flash operation is in progress
 *                FLASH_ERROR_BYTES -
 *                    Number of bytes did not match erase size
 *                FLASH_ERROR_ADDRESS -
 *                    Invalid address, this is only for DF
 *                FLASH_ERROR_OVERFLOW -
 *                    Erase attempted to go past end of data flash.
 ******************************************************************************/
uint8_t R_FlashEraseRange(uint32_t start_addr, uint32_t bytes)
{
    /* Declare erase operation result container variable */
    uint8_t result = FLASH_SUCCESS;

    /* Take off upper byte since for programming/erase addresses for ROM are
        the same as read addresses except upper byte is masked off to 0's.
        Data Flash addresses are not affected. */
    start_addr &= 0x00FFFFFF;

    /* Make sure 'bytes' is not 0. */
    if (0 == bytes)
    {
        return FLASH_ERROR_BYTES;
    }

    /* Confirm this is for data flash */
    if (start_addr >= DF_ADDRESS && start_addr < (DF_ADDRESS + FLASH_API_RX_CFG_DATA_FLASH_SIZE_BYTES))
    {
        /* Check if the number of bytes were passed is a multiple of the
           erase size for the data flash */
        if (bytes & (DF_ERASE_BLOCK_SIZE - 1))
        {
            /* Return number of bytes not a multiple of the programming size */
            return FLASH_ERROR_BYTES;
        }

        /* Check for an address on an erase boundary. */
        if (start_addr & (DF_ERASE_BLOCK_SIZE - 1))
        {
            /* Return address not on a programming boundary */
            return FLASH_ERROR_ALIGNED;
        }

        /* Check to make sure erase will not go over the end of DF. */
        if ((start_addr + bytes) > (DF_ADDRESS + FLASH_API_RX_CFG_DATA_FLASH_SIZE_BYTES))
        {
            return FLASH_ERROR_OVERFLOW;
        }
    }
    else
    {
        /* This function is only for data flash blocks. */
        return FLASH_ERROR_ADDRESS;
    }

    /* Attempt to grab state */
    if (FLASH_SUCCESS != flash_grab_state(FLASH_ERASING))
    {
        /* Another operation is already in progress */
        return FLASH_BUSY;
    }

    /* Set current FCU mode to data flash PE */
    g_current_mode = FLD_PE_MODE;

    /* Enter ROM PE mode, check if operation successful */
    if (FLASH_SUCCESS != enter_pe_mode(start_addr))
    {
        /* Make sure part is in ROM read mode. */
        exit_pe_mode();

        /* Release state */
        flash_release_state();

        /* Return FLASH_FAILURE, operation failure */
        return FLASH_FAILURE;
    }


#if defined(FLASH_API_RX_CFG_DATA_FLASH_BGO)
    /* Set global variables so that erase can continue in ISR. */
    g_bgo_flash_addr = start_addr + DF_ERASE_BLOCK_SIZE;
    g_bgo_bytes      = bytes - DF_ERASE_BLOCK_SIZE;
#endif

    /* Erase real data flash blocks until the 'fake' block is erased .*/
    while (0 < bytes)
    {

        /* Send FCU command to erase block */
        result = flash_erase_command((FCU_BYTE_PTR)start_addr);

