hirata0517masato/RX621-CMouse/RX621_Cmausu_3rd_white1mm-15mm/r_flash_api_rx.c
#if defined(FLASH_API_RX_CFG_DATA_FLASH_BGO)
        /* Return, check result and continue erasure later in ISR */
        return FLASH_SUCCESS;
#endif

        /* Advance pointer to next block */
        start_addr += DF_ERASE_BLOCK_SIZE;

        /* Subtract off bytes erased */
        bytes -= DF_ERASE_BLOCK_SIZE;

    }

    /* Leave Program/Erase Mode */
    exit_pe_mode();

    /* Release state */
    flash_release_state();

    /* Return erase result */
    return result;
}
/******************************************************************************
 End of function  R_FlashEraseRange
 ******************************************************************************/
#endif /* defined(DF_GROUPED_BLOCKS) */

/******************************************************************************
 * Function Name: flash_erase_command
 * Description  : Issues the FCU command to erase a flash block
 *                NOTE: This function MUST execute from in RAM for 'ROM Area'
 *                programming, but if you are ONLY doing Data Flash programming,
 *                this function can reside and execute in Flash.
 * Arguments    : erase_addr -
 *                    An address in the block to be erased
 * Return Value : FLASH_SUCCESS -
 *                    Operation Successful
 *                FLASH_FAILURE -
 *                    Operation Failed
 ******************************************************************************/
static uint8_t flash_erase_command(FCU_BYTE_PTR const erase_addr)
{
    /* Declare timer wait count variable */
    volatile int32_t wait_cnt;
    /* Declare erase operation result container variable */
    uint8_t result = FLASH_SUCCESS;

#if defined(FLASH_API_RX_CFG_DATA_FLASH_BGO) || defined(FLASH_API_RX_CFG_ROM_BGO)
    /*  Set which P / E mode is ROM or data flash */
    uint8_t  current_mode = g_current_mode;
#endif

    /* Send the FCU Command */
    *erase_addr = 0x20;
    *erase_addr = 0xD0;

#if defined(FLASH_API_RX_CFG_ROM_BGO)
    if (ROM_PE_MODE == current_mode)
    {
        /* Return, check result later in ISR */
        return FLASH_SUCCESS;
    }
#endif

#if defined(FLASH_API_RX_CFG_DATA_FLASH_BGO)
    if (FLD_PE_MODE == current_mode)
    {
        /* Return, check result later in ISR */
        return FLASH_SUCCESS;
    }
#endif

    /* Set the wait counter timeout duration */
    wait_cnt = WAIT_MAX_ERASE;

    /* Wait while FCU operation is in progress */
    while (0 == FLASH.FSTATR0.BIT.FRDY)
    {
        /* Decrement the wait counter */
        wait_cnt--;

        /* Check if the wait counter has reached zero */
        if (0 == wait_cnt)
        {

            /* Maximum timeout duration for erasing a ROM block has
               elapsed, assuming operation failure - reset the FCU */
            flash_reset();

            /* Return FLASH_FAILURE, operation failure */
            return FLASH_FAILURE;
        }
    }

    /* Check if erase operation was successful by checking
       bit 'ERSERR' (bit5) and 'ILGLERR' (bit 6) of register 'FSTATR0' */
    /* Check FCU error */
    if ((1 == FLASH.FSTATR0.BIT.ILGLERR) || (1 == FLASH.FSTATR0.BIT.ERSERR))
    {
        result = FLASH_FAILURE;
    }

    /* Return erase result */
    return result;
}
/******************************************************************************
 End of function  flash_erase_command
 ******************************************************************************/

/******************************************************************************
 * Function Name: R_FlashWrite
 * Description  : Writes bytes into flash.
 *                NOTE: This function MUST execute from in RAM for 'ROM Area'
 *                programming, but if you are ONLY doing Data Flash programming,
 *                this function can reside and execute in Flash.
 * Arguments    : flash_addr -
 *                    Flash address location to write to. This address
 *                    must be on a program boundary (e.g. RX62N has
 *                    256-byte ROM writes and 8-byte DF writes).
 *                buffer_addr -
 *                    Address location of data buffer to write into flash.
 *                bytes -
 *                    The number of bytes to write. You must always pass a
 *                    multiple of the programming size (e.g. RX62N has
 *                    256-byte ROM writes and 8-byte DF writes).
 * Return Value : FLASH_SUCCESS -
 *                    Operation Successful
 *                FLASH_FAILURE -
 *                    Operation Failed
 *                FLASH_ERROR_ALIGNED -
 *                    Flash address was not on correct boundary
 *                FLASH_ERROR_BYTES -
 *                    Number of bytes did not match programming size of ROM or DF
 *                FLASH_ERROR_ADDRESS -
 *                    Invalid address
 *                FLASH_ERROR_BOUNDARY -
 *                    (ROM) Cannot write across flash areas.
 *                FLASH_BUSY -
 *                    Flash is busy with another operation
 *                FLASH_ERROR_OVERFLOW -
 *                    Write attempted to go past end of ROM or DF.
 ******************************************************************************/
uint8_t R_FlashWrite(uint32_t flash_addr,
                     uint32_t buffer_addr,
                     uint16_t bytes)
{
    /* Declare result container and number of bytes to write variables */
    uint8_t  result = FLASH_SUCCESS;
    uint32_t num_byte_to_write;
    /*  Set which P / E mode is ROM or data flash */
    uint8_t  current_mode = READ_MODE;
#ifdef FLASH_API_RX_CFG_FLASH_TO_FLASH
    /* Local variable when using FLASH_API_RX_CFG_FLASH_TO_FLASH */
    uint16_t i;
#endif

    /* Take off upper byte since for programming/erase addresses for ROM are
        the same as read addresses except upper byte is masked off to 0's.
        Data Flash addresses are not affected. */
    flash_addr &= 0x00FFFFFF;

    /* Make sure 'bytes' is not 0. */
    if (0 == bytes)
    {
        return FLASH_ERROR_BYTES;
    }

    /* ROM area or Data Flash area - Check for DF first */
    if (flash_addr >= DF_ADDRESS && (flash_addr < DF_ADDRESS + FLASH_API_RX_CFG_DATA_FLASH_SIZE_BYTES))
    {
        /* Check if the number of bytes were passed is a multiple of the
           programming size for the data flash */
        if (bytes & (DF_PROGRAM_SIZE_SMALL - 1))
        {
            /* Return number of bytes not a multiple of the programming size */
            return FLASH_ERROR_BYTES;
        }

        /* Check for an address on a programming boundary. */
        if (flash_addr & (DF_PROGRAM_SIZE_SMALL - 1))
        {
            /* Return address not on a programming boundary */
            return FLASH_ERROR_ALIGNED;
        }

        /* Check to make sure erase will not go over the end of DF. */
        if ((flash_addr + bytes) > (DF_ADDRESS + FLASH_API_RX_CFG_DATA_FLASH_SIZE_BYTES))
        {
            return FLASH_ERROR_OVERFLOW;
        }
    }
    /* Check for ROM area */
    else if (  (flash_addr >= ROM_PE_ADDR)
            && (flash_addr < ROM_PE_ADDR + FLASH_API_RX_CFG_ROM_SIZE_BYTES))
    {
        /* First make sure that ROM operations are enabled. */
#if !defined(FLASH_API_RX_CFG_ENABLE_ROM_PROGRAMMING)
        /* ROM operations are not enabled! Enable them in r_flash_api_rx_config.h */
        return FLASH_FAILURE;
#else

