hirata0517masato/RX621-CMouse/RX621_Cmausu_3rd_white1mm-15mm/r_flash_api_rx.c
#if defined(FLASH_API_RX_CFG_DATA_FLASH_BGO)
        if (FLD_PE_MODE == current_mode)
        {
            /* Return FLASH_SUCCESS, rest of programming will be done
               in interrupt */
            return FLASH_SUCCESS;
        }
#endif
#if defined(FLASH_API_RX_CFG_ROM_BGO)
        if (ROM_PE_MODE == current_mode)
        {
            /* Return FLASH_SUCCESS, rest of programming will be done
               in interrupt */
            return FLASH_SUCCESS;
        }
#endif

#if (!defined(FLASH_API_RX_CFG_ROM_BGO)) || (!defined(FLASH_API_RX_CFG_DATA_FLASH_BGO))

        /* Increment the flash address and the buffer address by the size
           of the transfer thats just completed */
        flash_addr += num_byte_to_write;
        buffer_addr += num_byte_to_write;

        /* Decrement the number of bytes remaining by the size of the last
           flash write */
        bytes -= num_byte_to_write;

#ifdef FLASH_API_RX_CFG_FLASH_TO_FLASH
        /* Check to see if we need to buffer more data */
        if ((bytes > 0) &&
            (1 == g_flash_to_flash_op))
        {
            /* We must leave PE mode to transfer next buffer to RAM */
            exit_pe_mode();

            /* Get maximum programming size that can currently be used. */
            num_byte_to_write = flash_get_program_size((uint32_t)bytes, flash_addr);

            /* Copy over up to next bytes */
            for (i = 0; i < num_byte_to_write; i++)
            {
                /* Copy over each byte */
                g_temp_array[i] = *((uint8_t *)(buffer_addr+i));
            }

            /* Re-enter PE mode, check if operation is successful */
            if (FLASH_SUCCESS != enter_pe_mode(flash_addr))
            {
                /* Make sure part is in ROM read mode. */
                exit_pe_mode();

                /* Release state */
                flash_release_state();

                /* Return operation failure */
                return FLASH_FAILURE;
            }
        }
#endif
#endif
    }

    /* Leave Program/Erase Mode */
    exit_pe_mode();

    /* Release state */
    flash_release_state();

    /* Return flash programming result */
    return result;
}
/******************************************************************************
 End of function  R_FlashWrite
 ******************************************************************************/

/******************************************************************************
 * Function Name: notify_peripheral_clock
 * Description  : Notifies FCU or clock supplied to flash unit
 *                NOTE: This function MUST execute from in RAM for 'ROM Area'
 *                programming, but if you are ONLY doing Data Flash programming,
 *                this function can reside and execute in Flash.
 * Arguments    : flash_addr -
 *                    Flash address you will be erasing or writing to
 * Return Value : FLASH_SUCCESS -
 *                    Operation Successful
 *                FLASH_FAILURE -
 *                    Operation Failed
 ******************************************************************************/
static uint8_t notify_peripheral_clock(FCU_BYTE_PTR flash_addr)
{
    /* Declare wait counter variable */
    volatile int32_t wait_cnt;

    /* Notify Peripheral Clock(PCK) */
    /* Set frequency of PCK in MHz */
    FLASH.PCKAR.WORD = (FLASH_API_RX_CFG_FCLK_HZ/1000000);

    /* Execute Peripheral Clock Notification Commands */
    *flash_addr = 0xE9;
    *flash_addr = 0x03;
    *(FCU_WORD_PTR)flash_addr = 0x0F0F;
    *(FCU_WORD_PTR)flash_addr = 0x0F0F;
    *(FCU_WORD_PTR)flash_addr = 0x0F0F;
    *flash_addr = 0xD0;

    /* Set timeout wait duration */
    wait_cnt = WAIT_MAX_NOTIFY_FCU_CLOCK;

    /* Check FRDY */
    while (0 == FLASH.FSTATR0.BIT.FRDY)
    {
        /* Decrement wait counter */
        wait_cnt--;

        /* Check if wait counter has reached zero */
        if (0 == wait_cnt)
        {
            /* Timeout duration elapsed, assuming operation failure - Reset
               FCU */
            flash_reset();

            /* Return FLASH_FAILURE, operation failure  */
            return FLASH_FAILURE;
        }
    }

    /* Check ILGLERR */
    if(1 == FLASH.FSTATR0.BIT.ILGLERR)
    {
        /* Return FLASH_FAILURE, operation failure*/
        return FLASH_FAILURE;
    }

    /* Return FLASH_SUCCESS, operation success */
    return FLASH_SUCCESS;
}
/******************************************************************************
 End of function notify_peripheral_clock
 ******************************************************************************/

/******************************************************************************
 * Function Name: flash_reset
 * Description  : Reset the FCU.
 *                NOTE: This function MUST execute from in RAM for 'ROM Area'
 *                programming, but if you are ONLY doing Data Flash
 *                programming, this function can reside and execute in Flash.
 * Arguments    : none
 * Return Value : none
 ******************************************************************************/
static void flash_reset(void)
{
    /* Declare wait counter variable */
    volatile int32_t    wait_cnt;

    /* Reset the FCU */
    FLASH.FRESETR.WORD = 0xCC01;

    /* Give FCU time to reset */
    wait_cnt = WAIT_TRESW;

    /* Wait until the timer reaches zero */
    while (0 != wait_cnt)
    {
        /* Decrement the timer count each iteration */
        wait_cnt--;
    }

    /* Release state */
    flash_release_state();

    /* FCU is not reset anymore */
    FLASH.FRESETR.WORD = 0xCC00;

    /* Enter ROM Read mode */
    FLASH.FENTRYR.WORD = 0xAA00;

    /* Initialize timeout for FENTRYR being written. */
    wait_cnt = FLASH_FENTRYR_TIMEOUT;

    /* Read FENTRYR to ensure it has been set to 0. Note that the top byte
       of the FENTRYR register is not retained and is read as 0x00. */
    while (0x0000 != FLASH.FENTRYR.WORD)
    {
        /* Wait until FENTRYR is 0 unless timeout occurs. */
        if (wait_cnt-- <= 0)
        {
            /* This should not happen. FENTRYR getting written to 0 should
               only take 2-4 PCLK cycles. Could add a call to FlashError()
               here if user wants to process this. */
            break;
        }
    }

    /* Flash write/erase disabled */
    FLASH.FWEPROR.BYTE = 0x02;

    /* The clock supplied to the flash needs to be notified to the FCU again. */
    g_fcu_pclk_command = 0;
}
/******************************************************************************
 End of function  flash_reset
 ******************************************************************************/

