hirata0517masato/RX621-CMouse/RX621_Cmausu_3rd_white1mm-15mm/r_flash_api_rx.c
/******************************************************************************
 * Function Name: flash_get_program_size
 * Description  : Gets the number of bytes that can be written at this time.
 *                Since the DF and ROM have different available programming
 *                sizes, we want to use the largest option to save time.
 * Arguments    : bytes -
 *                    How many bytes are left to write total.
 *                flash_addr -
 *                    Current address we are writing to.
 * Return Value : Number of bytes to write at this time.
 ******************************************************************************/
static uint32_t flash_get_program_size(uint32_t bytes, uint32_t flash_addr)
{
    uint32_t num_byte_to_write = 0;

    /* These macros are used to remove warnings from the compiler that the
     * 'bytes' and 'flash_addr' parameters are never referenced. This happens
     * when a MCU does not have more than 1 DF program size. Using this macro
     * will not actually generate code.
     */
    INTERNAL_NOT_USED(bytes);
    INTERNAL_NOT_USED(flash_addr);

    if (FLD_PE_MODE == g_current_mode)
    {
        /* This is a DF write. */
#if defined(DF_PROGRAM_SIZE_LARGE)
        if ( (bytes >= DF_PROGRAM_SIZE_LARGE) &&
            ((flash_addr & (DF_PROGRAM_SIZE_LARGE-1)) == 0x00))
        {
            /* Use large write size since it's more time efficient */
            num_byte_to_write = DF_PROGRAM_SIZE_LARGE;
        }
        else
        {
            /* Cannot use large program size, use small */
            num_byte_to_write = DF_PROGRAM_SIZE_SMALL;
        }
#else
        /* Set the next data transfer size to be DF_PROGRAM_SIZE_SMALL*/
        num_byte_to_write = DF_PROGRAM_SIZE_SMALL;
#endif
    }
    else
    {
        /* This is a ROM write. */
#if defined(ROM_PROGRAM_SIZE_LARGE)
        if ( (bytes >= ROM_PROGRAM_SIZE_LARGE) &&
            ((flash_addr & (ROM_PROGRAM_SIZE_LARGE-1)) == 0x00))
        {
            /* Use large write size since it's more time efficient */
            num_byte_to_write = ROM_PROGRAM_SIZE_LARGE;
        }
#if defined(ROM_PROGRAM_SIZE_MEDIUM)
        else if ((bytes >= ROM_PROGRAM_SIZE_MEDIUM) &&
                ((flash_addr & (ROM_PROGRAM_SIZE_MEDIUM - 1)) == 0x00))
        {
            /* Use large write size since it's more time efficient */
            num_byte_to_write = ROM_PROGRAM_SIZE_MEDIUM;
        }
#endif
        else
        {
            /* Cannot use large program size, use small */
            num_byte_to_write = ROM_PROGRAM_SIZE_SMALL;
        }
#else
        /* Set the next data transfer size to be smallest supported write. */
        num_byte_to_write = ROM_PROGRAM_SIZE;
#endif
    }

    return num_byte_to_write;
}
/******************************************************************************
 End of function  flash_get_program_size
 ******************************************************************************/

#ifndef  FLASH_API_RX_CFG_IGNORE_LOCK_BITS
/******************************************************************************
 * Function Name: R_FlashProgramLockBit
 * Description  : Programs the lock bit for a specified ROM erasure block. If
 *                the lock bit for a block is set and lock bit protection is
 *                enabled then that block cannot be programmed/erased.
 *                NOTE: This function MUST execute from RAM
 * Arguments    : block -
 *                    Which ROM erasure block to set the lock bit for
 * Return Value : FLASH_SUCCESS -
 *                    Operation Successful
 *                FLASH_FAILURE -
 *                    Operation Failed
 *                FLASH_BUSY -
 *                    Another flash operation is in progress
 *                FLASH_ERROR_ADDRESS -
 *                    Invalid block input.
 ******************************************************************************/
uint8_t R_FlashProgramLockBit(uint32_t block)
{
    /* Declare address pointer */
    FCU_BYTE_PTR p_addr;

    /* Declare operation result container variable */
    uint8_t result = FLASH_SUCCESS;

    /* Declare timer wait count variable */
    volatile int32_t wait_cnt;

    /* Make sure valid block was input. */
    if ((false == flash_valid_block_check(block)) || (block >= BLOCK_DB0))
    {
        return FLASH_ERROR_ADDRESS;
    }

    /* Attempt to grab state */
    if (FLASH_SUCCESS != flash_grab_state(FLASH_LOCK_BIT))
    {
        /* Another operation is already in progress */
        return FLASH_BUSY;
    }

    /* Flash Command Address */
    p_addr = (FCU_BYTE_PTR)(g_flash_BlockAddresses[block]);

    /* Set FCU to ROM PE mode */
    g_current_mode = ROM_PE_MODE;

    /* Enter ROM PE mode, check if operation successful */
    if (FLASH_SUCCESS != enter_pe_mode((uint32_t) p_addr))
    {
        /* Make sure part is in ROM read mode. */
        exit_pe_mode();

        /* Release state */
        flash_release_state();

        /* Return FLASH_FAILURE, operation failure */
        return FLASH_FAILURE;
    }

    /* Send the FCU Command */
    *p_addr = 0x77;
    *p_addr = 0xD0;

    /* Set timeout wait counter value */
    wait_cnt = WAIT_MAX_ROM_WRITE;


    /* Wait until FCU operation finishes, or a timeout occurs */
    while (0 == FLASH.FSTATR0.BIT.FRDY)
    {
        /* Decrement the wait counter */
        wait_cnt--;

        /* Check if the wait counter has reached zero */
        if (0 == wait_cnt)
        {
            /* Maximum timeout duration for writing to ROM has elapsed -
               assume operation failure and reset the FCU */
            flash_reset();

            /* Return FLASH_FAILURE, operation failure */
            result = FLASH_FAILURE;
        }
    }


    /* Check for illegal command or programming errors */
    if ((1 == FLASH.FSTATR0.BIT.ILGLERR) || (1 == FLASH.FSTATR0.BIT.PRGERR))
    {
        /* Return FLASH_FAILURE, operation failure */
        result = FLASH_FAILURE;
    }

    /* Leave Program/Erase Mode */
    exit_pe_mode();

    /* Release state */
    flash_release_state();

    /* Return result of lock bit programming */
    return result;
}
/******************************************************************************
 End of function  R_FlashProgramLockBit
 ******************************************************************************/

