hirata0517masato/RX621-CMouse/RX621_Cmausu_3rd_white1mm-15mm/r_flash_api_rx.c
/******************************************************************************
 * Function Name: R_FlashReadLockBit
 * Description  : Reads and returns the lock bit status for a ROM block
 *                NOTE: This function MUST execute from RAM
 * Arguments    : block -
 *                    Which ROM erasure block to read the lock bit of
 * Return Value : FLASH_LOCK_BIT_SET -
 *                    Lock bit was set
 *                FLASH_LOCK_BIT_NOT_SET -
 *                    Lock bit was not set
 *                FLASH_FAILURE -
 *                    Operation Failed
 *                FLASH_BUSY -
 *                    Another flash operation is in progress
 *                FLASH_ERROR_ADDRESS -
 *                    Invalid block input.
 ******************************************************************************/
uint8_t R_FlashReadLockBit(uint32_t block)
{
    /* Declare address pointer */
    FCU_BYTE_PTR p_addr;

    /* Declare operation result container variable */
    uint8_t result = FLASH_SUCCESS;

    /* Holds outcome of lock-bit read */
    uint8_t lock_bit;

    /* Make sure valid block was input. */
    if ((false == flash_valid_block_check(block)) || (block >= BLOCK_DB0))
    {
        return FLASH_ERROR_ADDRESS;
    }

    /* Attempt to grab state */;
    if (FLASH_SUCCESS != flash_grab_state(FLASH_LOCK_BIT))
    {
        /* Another operation is already in progress */
        return FLASH_BUSY;
    }

    /* Flash Command Address */
    p_addr = (FCU_BYTE_PTR)(g_flash_BlockAddresses[block]);

    /* Set FCU to ROM PE mode */
    g_current_mode = ROM_PE_MODE;

    /* Enter ROM PE mode, check if operation successful */
    if (FLASH_SUCCESS != enter_pe_mode((uint32_t) p_addr))
    {
        /* Make sure part is in ROM read mode. */
        exit_pe_mode();

        /* Release state */
        flash_release_state();

        /* Return FLASH_FAILURE, operation failure */
        return FLASH_FAILURE;
    }

    /* Switch to ROM Lock-Bit Read Mode */
    *p_addr = 0x71;

    /* Check for illegal command */
    if (1 == FLASH.FSTATR0.BIT.ILGLERR)
    {
        /* Return FLASH_FAILURE, operation failure */
        result = FLASH_FAILURE;
    }
    else
    {
        /* Read lock bit value */
        lock_bit = *p_addr;

        /* Set return value */
        if (0x00 != lock_bit)
        {
            /* Lock bit is not set */
            result = FLASH_LOCK_BIT_NOT_SET;
        }
        else
        {
            /* Lock bit is set */
            result = FLASH_LOCK_BIT_SET;
        }
    }

    /* Leave Program/Erase Mode */
    exit_pe_mode();

    /* Release state */
    flash_release_state();

    /* Return result of lock bit programming */
    return result;
}
/******************************************************************************
 End of function  R_FlashReadLockBit
 ******************************************************************************/
#endif /* FLASH_API_RX_CFG_IGNORE_LOCK_BITS */

